k6/trace/get_r300.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: get_300.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 5 VUs  0m01.0s/1m0s

running (0m02.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  0m02.0s/1m0s

running (0m03.0s), 5/5 VUs, 24 complete and 0 interrupted iterations
default   [   5% ] 5 VUs  0m03.0s/1m0s

running (0m04.0s), 5/5 VUs, 32 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  0m04.0s/1m0s

running (0m05.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [   8% ] 5 VUs  0m05.0s/1m0s

running (0m06.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  0m06.0s/1m0s

running (0m07.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  12% ] 5 VUs  0m07.0s/1m0s

running (0m08.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  0m08.0s/1m0s

running (0m09.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
default   [  15% ] 5 VUs  0m09.0s/1m0s

running (0m10.0s), 5/5 VUs, 84 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  0m10.0s/1m0s

running (0m11.0s), 5/5 VUs, 93 complete and 0 interrupted iterations
default   [  18% ] 5 VUs  0m11.0s/1m0s

running (0m12.0s), 5/5 VUs, 102 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  0m12.0s/1m0s

running (0m13.0s), 5/5 VUs, 111 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  0m13.0s/1m0s

running (0m14.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  0m14.0s/1m0s

running (0m15.0s), 5/5 VUs, 127 complete and 0 interrupted iterations
default   [  25% ] 5 VUs  0m15.0s/1m0s

running (0m16.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  0m16.0s/1m0s

running (0m17.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
default   [  28% ] 5 VUs  0m17.0s/1m0s

running (0m18.0s), 5/5 VUs, 154 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  0m18.0s/1m0s

running (0m19.0s), 5/5 VUs, 162 complete and 0 interrupted iterations
default   [  32% ] 5 VUs  0m19.0s/1m0s

running (0m20.0s), 5/5 VUs, 171 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  0m20.0s/1m0s

running (0m21.0s), 5/5 VUs, 180 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  0m21.0s/1m0s

running (0m22.0s), 5/5 VUs, 188 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  0m22.0s/1m0s

running (0m23.0s), 5/5 VUs, 198 complete and 0 interrupted iterations
default   [  38% ] 5 VUs  0m23.0s/1m0s

running (0m24.0s), 5/5 VUs, 207 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  0m24.0s/1m0s

running (0m25.0s), 5/5 VUs, 215 complete and 0 interrupted iterations
default   [  42% ] 5 VUs  0m25.0s/1m0s

running (0m26.0s), 5/5 VUs, 223 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  0m26.0s/1m0s

running (0m27.0s), 5/5 VUs, 233 complete and 0 interrupted iterations
default   [  45% ] 5 VUs  0m27.0s/1m0s

running (0m28.0s), 5/5 VUs, 240 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  0m28.0s/1m0s

running (0m29.0s), 5/5 VUs, 250 complete and 0 interrupted iterations
default   [  48% ] 5 VUs  0m29.0s/1m0s

running (0m30.0s), 5/5 VUs, 259 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  0m30.0s/1m0s

running (0m31.0s), 5/5 VUs, 267 complete and 0 interrupted iterations
default   [  52% ] 5 VUs  0m31.0s/1m0s

running (0m32.0s), 5/5 VUs, 277 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  0m32.0s/1m0s

running (0m33.0s), 5/5 VUs, 285 complete and 0 interrupted iterations
default   [  55% ] 5 VUs  0m33.0s/1m0s

running (0m34.0s), 5/5 VUs, 295 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  0m34.0s/1m0s

running (0m35.0s), 5/5 VUs, 303 complete and 0 interrupted iterations
default   [  58% ] 5 VUs  0m35.0s/1m0s

running (0m36.0s), 5/5 VUs, 312 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  0m36.0s/1m0s

running (0m37.0s), 5/5 VUs, 320 complete and 0 interrupted iterations
default   [  62% ] 5 VUs  0m37.0s/1m0s

running (0m38.0s), 5/5 VUs, 329 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  0m38.0s/1m0s

running (0m39.0s), 5/5 VUs, 339 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  0m39.0s/1m0s

running (0m40.0s), 5/5 VUs, 348 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  0m40.0s/1m0s

running (0m41.0s), 5/5 VUs, 356 complete and 0 interrupted iterations
default   [  68% ] 5 VUs  0m41.0s/1m0s

running (0m42.0s), 5/5 VUs, 365 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  0m42.0s/1m0s

running (0m43.0s), 5/5 VUs, 375 complete and 0 interrupted iterations
default   [  72% ] 5 VUs  0m43.0s/1m0s

running (0m44.0s), 5/5 VUs, 383 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  0m44.0s/1m0s

running (0m45.0s), 5/5 VUs, 391 complete and 0 interrupted iterations
default   [  75% ] 5 VUs  0m45.0s/1m0s

running (0m46.0s), 5/5 VUs, 399 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  0m46.0s/1m0s

running (0m47.0s), 5/5 VUs, 407 complete and 0 interrupted iterations
default   [  78% ] 5 VUs  0m47.0s/1m0s

running (0m48.0s), 5/5 VUs, 415 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  0m48.0s/1m0s

running (0m49.0s), 5/5 VUs, 423 complete and 0 interrupted iterations
default   [  82% ] 5 VUs  0m49.0s/1m0s

running (0m50.0s), 5/5 VUs, 432 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  0m50.0s/1m0s

running (0m51.0s), 5/5 VUs, 442 complete and 0 interrupted iterations
default   [  85% ] 5 VUs  0m51.0s/1m0s

running (0m52.0s), 5/5 VUs, 450 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  0m52.0s/1m0s

running (0m53.0s), 5/5 VUs, 458 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  0m53.0s/1m0s

running (0m54.0s), 5/5 VUs, 467 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  0m54.0s/1m0s

running (0m55.0s), 5/5 VUs, 476 complete and 0 interrupted iterations
default   [  92% ] 5 VUs  0m55.0s/1m0s

running (0m56.0s), 5/5 VUs, 485 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  0m56.0s/1m0s

running (0m57.0s), 5/5 VUs, 493 complete and 0 interrupted iterations
default   [  95% ] 5 VUs  0m57.0s/1m0s

running (0m58.0s), 5/5 VUs, 503 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  0m58.0s/1m0s

running (0m59.0s), 5/5 VUs, 511 complete and 0 interrupted iterations
default   [  98% ] 5 VUs  0m59.0s/1m0s

running (1m00.0s), 5/5 VUs, 520 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  1m00.0s/1m0s

     data_received..................: 1.9 MB 31 kB/s
     data_sent......................: 68 kB  1.1 kB/s
     http_req_blocked...............: avg=444.95µs min=244.38µs med=442.29µs max=883.73µs p(90)=521.44µs p(95)=564.46µs
     http_req_connecting............: avg=370.45µs min=205.23µs med=367.16µs max=793.34µs p(90)=442.16µs p(95)=477.18µs
     http_req_duration..............: avg=72.64ms  min=46.71ms  med=49.7ms   max=346.57ms p(90)=176.63ms p(95)=185.46ms
       { expected_response:true }...: avg=72.64ms  min=46.71ms  med=49.7ms   max=346.57ms p(90)=176.63ms p(95)=185.46ms
     http_req_failed................: 0.00%  ✓ 0        ✗ 525
     http_req_receiving.............: avg=23.14ms  min=21.89ms  med=22.72ms  max=45.02ms  p(90)=23.84ms  p(95)=24.95ms 
     http_req_sending...............: avg=44.44µs  min=22.16µs  med=41.38µs  max=488.18µs p(90)=55.5µs   p(95)=63.19µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=49.44ms  min=24.41ms  med=26.57ms  max=323.6ms  p(90)=153.3ms  p(95)=162.12ms
     http_reqs......................: 525    8.687946/s
     iteration_duration.............: avg=573.92ms min=547.63ms med=550.96ms max=848.23ms p(90)=677.69ms p(95)=686.71ms
     iterations.....................: 525    8.687946/s
     vus............................: 5      min=5      max=5
     vus_max........................: 5      min=5      max=5


running (1m00.4s), 0/5 VUs, 525 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  1m0s